{"product": {"name": "norton","reviews": [[{ "keys" : [{"feature" : "software", "opstr" : -3, "status" : []}],"sentence": "I have read the installation instructions for both NIS 2004 and NAV 2004 prior to installation, but still ended up with the same result...junk software."},{"keys": [], "sentence": "Why is it that I can install any other type of software and it installs and works properly?"},{ "keys" : [{"feature" : "Norton products", "opstr" : -3, "status" : []}],"sentence": "But if I installed either one of these Norton products, neither works after installation?"},{ "keys" : [{"feature" : "McAfee Anti-Virus 8", "opstr" : 2, "status" : []}],"sentence": "#It can not be the computer or the owner, since I purchased McAfee Anti-Virus 8 and it installs and works fine with no problems."},{ "keys" : [{"feature" : "Norton", "opstr" : -2, "status" : []}],"sentence": "I have used Norton for the past 5 years and for the last 2 years, the software has gotten more and more disgraceful."},{ "keys" : [{"feature" : "Norton", "opstr" : -2, "status" : []}],"sentence": "I am glad that I do not work for Norton."}],[{"keys": [], "sentence": "I have used Norton products in the past and I am familiar with them."},{"keys": [], "sentence": "I bought NIS 2004 recently to try it out."},{ "keys" : [{"feature" : "Installation", "opstr" : -2, "status" : []}],"sentence": "After 4 attempted installs, I have finally given up."},{"keys": [], "sentence": "I am thankful that I have Roxio GOBACK, I had to use it 3 of the 4 times."},{ "keys" : [{"feature" : "NIS", "opstr" : -2, "status" : []}],"sentence": "During install, NIS would either freeze or not reboot properly when asked to do so."},{ "keys" : [{"feature" : "Manual shutdown", "opstr" : -2, "status" : []}],"sentence": "The MS scandisk would appear due to manual shutdown and would only scan to the 2nd bar, over and over(up to 1 hr, I then shut it down and used GOBACK)."},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []},{"feature" : "uninstall", "opstr" : 2, "status" : []}],"sentence": "The 1 time it did install, it did not work and had errors, I used the unistall NIS icon and it properly removed itself."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "#I have never had this problem with any other software on my computer."},{ "keys" : [{"feature" : "NIS 2003", "opstr" : 2, "status" : []}],"sentence": "NIS 2003 worked like a charm last year."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "Being a past Norton customer, I consider this to be a slap to my face."},{ "keys" : [{"feature" : "installed", "opstr" : -2, "status" : []}],"sentence": "Buying software that can not be installed normally and being put into the position of having a non-working computer."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "Norton has been on a downhill slid recently with their products, but with this one, they have fallen off the cliff."}],[{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "#As a loyal customer of Norton/Symantec products, I purchased Internet Security 2004 as a software firewall and could not be any more dissatisfied with the product (and hence the one star rating)."},{"keys": [], "sentence": "Here's why:"}],[{ "keys" : [{"feature" : "program", "opstr" : -3, "status" : []}],"sentence": "Yeah - this program protects your computer all right - by locking you off the internet."},{ "keys" : [{"feature" : "Anti-Spam", "opstr" : 1, "status" : []}],"sentence": "Anti-Spam is Good"},{ "keys" : [{"feature" : "antispam function", "opstr" : 2, "status" : []}],"sentence": "The latest of Internet Security has antispam function that is helpful because I has received a mountain of those these days."},{ "keys" : [{"feature" : "updates", "opstr" : -2, "status" : []}],"sentence": "Other than that it is all the same except the new updates."},{ "keys" : [{"feature" : "Symantec softwares ", "opstr" : 2, "status" : []}],"sentence": "#But that is good for me because Symantec softwares are a bit hard to master for me who are not savvy on computers."},{ "keys" : [{"feature" : "scandisk", "opstr" : -1, "status" : []}],"sentence": "So far I haven't had so much complaints except that I still haven't mastered how to scandisk when using Internet Security."}],[{ "keys" : [{"feature" : "product", "opstr" : -2, "status" : []}],"sentence": "Too bad the product is cumbersome and intertwined trying to do so much at one time."},{ "keys" : [{"feature" : "suite", "opstr" : -2, "status" : []}],"sentence": "Sometimes a suite is not a good deal and all you get is a bundle of headaches."}],[{ "keys" : [{"feature" : "speed", "opstr" : 1, "status" : []}],"sentence": "I'm not sure why all the bad reviews, my computer isn't especially slowed down and I have Win'98."},{ "keys" : [{"feature" : "speed", "opstr" : 1, "status" : []}],"sentence": "Sure, it slows it down a little, but that's expected."},{ "keys" : [{"feature" : "Semantic", "opstr" : 1, "status" : []}],"sentence": "Perhaps Semantic could work out the efficiency a little, but these reviews are highly exagerated... I would ask what else these people are running on their computers(?)"},{"keys": [], "sentence": "I would ask what else these people are running on their computers(?)"},{"keys": [], "sentence": "So, if you have a fairly fast computer (1 gig or better) with plenty of ram (512) and your not gaming online or running streaming video continually, you should be fine."},{"keys": [], "sentence": "This is pretty standard for an up to date computer anymore, so what's the fuss?"}],[{"keys": [], "sentence": "I've been using Norton Anti-Virus in its many incarnations for over 5 years."},{ "keys" : [{"feature" : "NIS2004", "opstr" : -2, "status" : []}],"sentence": "Norton Internet Security 2004 is one of the more buggy implementations."},{"keys": [], "sentence": "Even for computer super-heros it's a pain to maintain when there is a problem."}],[{"keys": [], "sentence": "I also reviewed Norton System Works 2004/Professional."},{ "keys" : [{"feature" : "installation", "opstr" : -2, "status" : []}],"sentence": "This product has virtually all the same installation problems."},{ "keys" : [{"feature" : "product", "opstr" : -1, "status" : []}],"sentence": "For purposes of clarity, here is my review from that product,edited to be appropriate for this product, since, for the most part, they share many of the same problems."},{"keys": [], "sentence": "Something happened with this release for Norton System Works (2004) and for \"Internet Security 2004\"."},{ "keys" : [{"feature" : "SystemWorks", "opstr" : 3, "status" : []},{"feature" : "Internet Security", "opstr" : 3, "status" : []}],"sentence": "This is the fourth version of SystemWorks and the second version of Internet Security that I have used and it has always been a favorite."},{"keys": [], "sentence": "It has saved my system on more than one occasion, and makes disc clean up a snap."},{ "keys" : [{"feature" : "antivirus", "opstr" : 2, "status" : []}],"sentence": "The antivirus feature is phenomenal, and is regularly updated."},{ "keys" : [{"feature" : "antivirus", "opstr" : 2, "status" : []}],"sentence": "I think their antivirus software was one of, if not the best, on the"},{"keys": [], "sentence": "Well, no more."},{ "keys" : [{"feature" : "Internet Security 2004", "opstr" : -3, "status" : []}],"sentence": "This version of Internet Security 2004, is beyond hope."},{ "keys" : [{"feature" : "install", "opstr" : -3, "status" : []},{"feature" : "function", "opstr" : -2, "status" : []}],"sentence": "They are a royal pain to install, and don't function properly once finally installed -- if you can install them at all."},{ "keys" : [{"feature" : "installation", "opstr" : -3, "status" : []}],"sentence": "The biggest problem is the installation."},{ "keys" : [{"feature" : "installed", "opstr" : -2, "status" : []},{"feature" : "LiveUpdate", "opstr" : -1, "status" : []},{"feature" : "System Works", "opstr" : -1, "status" : []},{"feature" : "Internet Security", "opstr" : -1, "status" : []}],"sentence": "Also if you do manage to get it installed, any problems with LiveUpdate or with System Works will also affect the functionality and/or the process of updating Internet Security."},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "I've had to install and uninstall them four or five times so far, and I've not to get either product working properly."},{"keys": [], "sentence": "Why they brought this to market is beyond me."},{ "keys" : [{"feature" : "installation", "opstr" : -3, "status" : []}],"sentence": "First, it serious, serious installation problems."},{ "keys" : [{"feature" : "install", "opstr" : -3, "status" : []}],"sentence": "Back in May 2004, when I first reviewed this, it had taken me over 16 hours to install and run."},{"keys": [], "sentence": "Since then, I have had one problem after another."},{"keys": [], "sentence": "To say that it is \"buggy\" would be the world's most profound understatement."},{ "keys" : [{"feature" : "LiveUpdate", "opstr" : -2, "status" : []}],"sentence": "Almost from the beginning, LiveUpdate would not function."},{ "keys" : [{"feature" : "updates", "opstr" : -2, "status" : []}],"sentence": "First, it failed whenever connecting to get updates."},{ "keys" : [{"feature" : "LiveUpdate", "opstr" : -2, "status" : []}],"sentence": "When I finally got it working, it only worked properly for many a month."},{ "keys" : [{"feature" : "components", "opstr" : -2, "status" : []}],"sentence": "The next problem was that it didn't recognize all the installed components, so it would not update them, most notably and importantly, virus definitions."},{"keys": [], "sentence": "Without this important feature, both SystemWorks and Internet Security are all but useless."},{"keys": [], "sentence": "Without updated virus definiations, your PC is also at serious risk!"},{ "keys" : [{"feature" : "functions", "opstr" : 1, "status" : []}],"sentence": "#Once installed, however, some of the functions do work OK (Disk Doctor, One Button Checkup, and WinDoctor)."},{ "keys" : [{"feature" : "faster", "opstr" : 1, "status" : []},{"feature" : "menu", "opstr" : 2, "status" : []}],"sentence": "These tasks are faster and easier than in prior versions, and I found the menu to be much more navigable."},{ "keys" : [{"feature" : "LiveUpdate", "opstr" : -2, "status" : []}],"sentence": "But this doesn't make up for it's innumerable other short-comings, the biggest of which is the inability to download any updates due to problems with LiveUpdate."},{ "keys" : [{"feature" : "installs", "opstr" : -2, "status" : []}],"sentence": "The other annoyance with this that you have to remove every single remnant of previous version of Norton SystemWorks before you installs this."},{ "keys" : [{"feature" : "removal program", "opstr" : -2, "status" : []}],"sentence": "Warning! The Windows \"remove program\" feature does not do a good job of this, and neither does Norton's own removal program."},{ "keys" : [{"feature" : "fragments", "opstr" : -2, "status" : []}],"sentence": "#A lot of \"fragments\" were left in the Registry, and it the Norton system folders."},{ "keys" : [{"feature" : "remove", "opstr" : 1, "status" : []}],"sentence": "Their website had a download that helped remove those, although I had to manually remove a good number of files from the \"Programs\" directory."},{ "keys" : [{"feature" : "install", "opstr" : -3, "status" : []}],"sentence": "If you have an older version of \"Internet Security\" installed, you may also need to remove it as well before proceeding with SystemWorks install."},{ "keys" : [{"feature" : "remove", "opstr" : -2, "status" : []}],"sentence": "You also need to go in and MANUALLY remove many Symantec files from the REGISTRY."},{"keys": [], "sentence": "(Intructions for doing so are on Symantecs website.)"},{"keys": [], "sentence": "Even this, however, did not solve my problems."},{ "keys" : [{"feature" : "products", "opstr" : -3, "status" : []}],"sentence": "As of October, 2004, these products are NOT working and I'm ready to demand a refund from Symantec."},{ "keys" : [{"feature" : "functionality", "opstr" : -3, "status" : []}],"sentence": "I just uninstalled SystemWorks and Internet Security for at least the fifth time due to funtionality issues."},{ "keys" : [{"feature" : "reinstall", "opstr" : -3, "status" : []}],"sentence": "Once again it won't reinstall, even with online and email assistance from Symantect Technicians."},{ "keys" : [{"feature" : "version 2004", "opstr" : -3, "status" : []}],"sentence": "The best thing to do with this version, is to leave it on the store shelf. It doesn't work, and will cost you an enormous amount of your time, not to mention your hard earned dollars."},{ "keys" : [{"feature" : "Symantect products", "opstr" : -3, "status" : []}],"sentence": "Personally, I may never buy Symantect products again."},{"keys": [], "sentence": "And that's a shame."},{"keys": [], "sentence": "They use to be so useful and neceesary."},{"keys": [], "sentence": "No longer."},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "Avoid this product at all costs."}],[{"keys": [], "sentence": "Antagonising"},{ "keys" : [{"feature" : "2004 edition", "opstr" : -1, "status" : []}],"sentence": "There are some highs to the 2004 edition, but mostly lows."},{ "keys" : [{"feature" : "program", "opstr" : -2, "status" : []},{"feature" : "cost", "opstr" : -1, "status" : []}],"sentence": "The program brings more problems than a virus, albeit not as major problems, just not what you expect for 70 bucks."}],[{ "keys" : [{"feature" : "support", "opstr" : -2, "status" : []}],"sentence": "I had a question about the pros and cons of turning off the Norton firewall vs. the windows firewall, and waited 45 minutes to speak with a tech support representative because I did not have a \"customer priority ID number.\""},{ "keys" : [{"feature" : "priority ID", "opstr" : -1, "status" : []}],"sentence": "Then when I went to Norton's website to obtain a priority ID number per the instructions I had been given, I couldn't find a way to get one."},{ "keys" : [{"feature" : "support", "opstr" : -1, "status" : []}],"sentence": "So I e-mailed the online tech support with that simple question, and got a reply which was totally unresponsive (it looked as though they didn't actually read the e-mail and just sent back a few boilerplate paragraphs)."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "And, when you think about it, it's insulting that Norton requires its customers to jump through these hoops -- anyone who can provide proof of purchase, whether on the phone or online (what if your computer is down?), should have equal priority."},{"keys": [], "sentence": "I may not be a computer expert but I am perfectly capable of following detailed instructions, and Norton just makes life way too hard."},{"keys": [], "sentence": "Plus, when Norton provided online updates, there were so many unexplained categories (about 15 over and above virus definitions)"},{"keys": [], "sentence": "I was totally baffled."}],[{"keys": [], "sentence": "I originally had bought Norton Internet Security for my laptop after the preinstalled Norton Antivirus trial had finished."},{"keys": [], "sentence": "The hardest part was the run around with what software suite to buy."},{"keys": [], "sentence": "This package contains BOTH Norton Antivirus and Firewall."},{"keys": [], "sentence": "The only reason I'd buy them separately in the combo package is for two liecenses."},{"keys": [], "sentence": "If you want integrated Antivirus and Firewall this is what I'd suggest."},{ "keys" : [{"feature" : "memory usage", "opstr" : 2, "status" : []}],"sentence": "Norton's memory usage on systems with 512 MB is very low."},{"keys": [], "sentence": "It usually only takes 5-10 MB's of system memory."},{ "keys" : [{"feature" : "memory usage", "opstr" : 2, "status" : []}],"sentence": "I just got an older 866 Mhz system with 512 PC 133 RAM and it also runs fine on that."},{ "keys" : [{"feature" : "update", "opstr" : 1, "status" : []}],"sentence": "Both the antivirus and firewall are integrated into one piece of software and they update together."},{ "keys" : [{"feature" : "update", "opstr" : 2, "status" : []}],"sentence": "You won't need to update your firewall and antivirus separately or install two disks."},{ "keys" : [{"feature" : "visual backtracking", "opstr" : 3, "status" : []}],"sentence": "The best part of the firewall is the visual backtracking."},{"keys": [], "sentence": "An infected computer tried to launch an attack on mine and I was able to get a map and address of the server."}],[{"keys": [], "sentence": "I had the best intentions when I bought this, I really did."},{"keys": [], "sentence": "I followed the instructions to the letter."},{"keys": [], "sentence": "But it caused more headaches than I could imagine."},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "Stay away from this product!"},{ "keys" : [{"feature" : "2004", "opstr" : -3, "status" : []}],"sentence": "I don't know what's happened to Norton, but 2004 is absolute garbage."},{"keys": [], "sentence": "Apparently, they can't even fix the bugs that have overrun their own site."},{ "keys" : [{"feature" : "support", "opstr" : -3, "status" : []}],"sentence": "The customer support is pathetic."}],[{ "keys" : [{"feature" : "Norton internet security", "opstr" : -2, "status" : []}],"sentence": "I have found too many bugs in Norton Internet Security Professional to recommend it to any one without extreme patience and experience."}],[{"keys": [], "sentence": "Okay, how can I say this nicely?"},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "This product is absolutely not ready for release."},{ "keys" : [{"feature" : "slow", "opstr" : -3, "status" : []}],"sentence": "It is buggy, slow and basically frustrates the heck out of the user."},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "I am an IT professional and have used Norton for years, but this product is a complete and utter dud."}],[{"keys": [], "sentence": "Norton has a name in the market but I think it's only the name."},{ "keys" : [{"feature" : "Internet Security", "opstr" : -2, "status" : []},{"feature" : "antivirus", "opstr" : -2, "status" : []}],"sentence": "It's a rip off if one buys Norton Internet Security and antivirus."},{"keys": [], "sentence": "The former hogs memory and it takes ages for the computer to start."},{ "keys" : [{"feature" : "internet security", "opstr" : -2, "status" : []},{"feature" : "antivirus software", "opstr" : -2, "status" : []}],"sentence": "Nothing spectacular is done by internet security or by antivirus software."}],[{ "keys" : [{"feature" : "parental controls", "opstr" : -2, "status" : []}],"sentence": "Even though I have the parental controls off it constantly starts updating them then freezes my computer."},{"keys": [], "sentence": "Had to uninstall it."},{"keys": [], "sentence": "Maybe it's me, but this isn't my program."}],[{"keys": [], "sentence": "I have had Norton Internet Security for 3 yrs and up graded to 2004 versionin August 2004."},{ "keys" : [{"feature" : "firewall", "opstr" : -3, "status" : []}],"sentence": "Now in October,2004, the firewall said I couldn't OK anymore software to use the internet because its full."},{ "keys" : [{"feature" : "capacity", "opstr" : -3, "status" : []},{"feature" : "Support", "opstr" : -3, "status" : []}],"sentence": "Im at full capacity!!!! I called Symantic and they said they don't know why but I should get Tech's Support at $35/hr to help!! I did call them and was on hold for 55 minutes untill I hung up!"},{"keys": [], "sentence": "I am going to buy PC-cillium ASAP."},{ "keys" : [{"feature" : "product", "opstr" : -2, "status" : []},{"feature" : "upgrade", "opstr" : -2, "status" : []}],"sentence": "So, DON'T buy this or upgrade."}],[{ "keys" : [{"feature" : "2004 version", "opstr" : -2, "status" : []}],"sentence": "If you currently own the 2003 version, and are looking to upgrade to the 2004 version, don't."},{ "keys" : [{"feature" : "activation process", "opstr" : -1, "status" : []},{"feature" : "product", "opstr" : -2, "status" : []}],"sentence": "There is little meaningful difference between the two versions aside from the tedius activation process, and the product is currently rather buggy and has problems running unless cleanly installed on a formatted drive."},{ "keys" : [{"feature" : "product", "opstr" : -2, "status" : []}],"sentence": "If you are new to the market and looking to buy a symantec software product, save yourself some money and buy the 2003 version."},{"keys": [], "sentence": "It included popup and ad blockers, referrer blockers, firewall,  intrusion detection, and all the same things that the 2004 version includes that are really needed."}],[{"keys": [], "sentence": "This came PRELOADED on our new, 2.8Mz Pentium 4 256RAM computer."},{ "keys" : [{"feature" : "Norton program", "opstr" : -3, "status" : []}],"sentence": "From day one, we've had hangups, crashes, glitches, continual reboots, LONG shutdowns due to \"ccApp.exe\" program running which is a Norton program."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "Long reboots due to Norton taking FOREVER  to boot."},{ "keys" : [{"feature" : "memory usage", "opstr" : -3, "status" : []}],"sentence": "We constantly got \"Windows Virtual Memory Low\" error messages popping up follwed by ridiculous slowdowns and/or crashes."},{"keys": [], "sentence": "I don't have one good thing to say."},{"keys": [], "sentence": "I agree with the other reviewer that it doesn't even deserve 1 star."},{ "keys" : [{"feature" : "support", "opstr" : -2, "status" : []}],"sentence": "Norton online support does not even acknowledge this problem nor does the computer company that preloaded it on our new computer."},{"keys": [], "sentence": "It's a well-known company that I expected more from and spent 2 hours with tech support running all kinds of tests on the computer which of course came back reporting no trouble with the computer."},{"keys": [], "sentence": "The tests were right."},{"keys": [], "sentence": "It wasn't the computer - it was Norton Internet Security 2004 which is the culprit!!"},{ "keys" : [{"feature" : "support", "opstr" : -3, "status" : []}],"sentence": "#Norton support is completely pathetic."},{"keys": [], "sentence": "We were so fed up that we uninstalled ALL of Norton Internet/AV 2004 and were going to try McAffee, but a techie friend recommended trying Norton SystemWorks 2005 first."},{"keys": [], "sentence": "We were leary to say the least, but decided to give Norton the benefit of the doubt."},{"keys": [], "sentence": "We'd used Norton products like Internet Security 2003 forever with only rare troubles."},{"keys": [], "sentence": "The SystemWorks 2005 seems to be working GREAT!!"},{"keys": [], "sentence": "We've only had it 2 days, but so far so good.  (WRONG - SEE UPDATE BELOW)"},{"keys": [], "sentence": "I hope it's better than this hunk of junk Internet/AV 2004 package."},{"keys": [], "sentence": "If SystemWorks 2005 starts to act up, I'm done with Norton products forever."},{"keys": [], "sentence": "But I don't think SystemWorks 2005 will start acting up."},{"keys": [], "sentence": "72 hours later after installing, it started doing the exact same things!"},{"keys": [], "sentence": "So, we're fed up."},{ "keys" : [{"feature" : "HOME VERSION", "opstr" : -3, "status" : []}],"sentence": "DO NOT BUY ANY HOME VERSION OF NORTON ANYTHING."},{ "keys" : [{"feature" : "Corporate Edition", "opstr" : 2, "status" : []}],"sentence": "We were able to obtain a Norton Corporate Edition of Antivirus only (no firewall or utilities) and so far it's great."},{ "keys" : [{"feature" : "Corporate edition", "opstr" : 3, "status" : []}],"sentence": " I've used the Corporate edition at work without any problems ever."},{"keys": [], "sentence": "Unfortunately, you can't buy the corporate edition over the counter."},{ "keys" : [{"feature" : "Corporate edition", "opstr" : 2, "status" : []},{"feature" : "home version", "opstr" : -3, "status" : ["cs"]}],"sentence": "If we had been unable to obtain the Corporate edition, we would NOT have purchased another Norton 2004 or 2005 home version anything."},{"keys": [], "sentence": "We'd have probably tried McAffee, but I hear from reviews that it has troubles too."},{"keys": [], "sentence": "HMMMM.. Good luck."},{ "keys" : [{"feature" : "Norton Internet/AV 2004", "opstr" : -3, "status" : []}],"sentence": "Our Norton Internet/AV 2004 was terrible right from the get go, so I'd think that if SytemWorks is ok now, it should remain ok."},{"keys": [], "sentence": "I'll update my review if I find out otherwise."},{"keys": [], "sentence": "WRONG - SEE MY UPDATE ABOVE."},{ "keys" : [{"feature" : "corporate", "opstr" : 3, "status" : []}],"sentence": "By the way, I use the Norton 2003 Corporate at work with absolutely no trouble."},{ "keys" : [{"feature" : "professional version", "opstr" : 2, "status" : []}],"sentence": "Likewise, I've heard Norton 2004 PROFESSIONAL version is fine too."},{ "keys" : [{"feature" : "home version", "opstr" : -2, "status" : []}],"sentence": "Just the home version of Norton Internet/AV has too many glitches and problems to even remotely bother with."},{"keys": [], "sentence": "Trust me and all the other reviews on this one."}],[{"keys": [], "sentence": "I have always sworn by Norton Anti-Virus and SystemWorks products, and have used them both for years."},{"keys": [], "sentence": "So I expected the same level of quality and ease of use with their Internet Security program."},{ "keys" : [{"feature" : "work", "opstr" : -3, "status" : []}],"sentence": "I am an advanced computer user, so I cannot even imagine how a new or novice user would ever get this terrible program to work!"},{"keys": [], "sentence": "After installing, the system froze trying to restart (this is a new computer with Windows XP Home)."},{"keys": [], "sentence": "After finally restarting, the \"automatic updates\" ran."},{"keys": [], "sentence": "When all was said and done, I couldn't even use Microsoft Outlook."},{ "keys" : [{"feature" : "program scan", "opstr" : -1, "status" : []}],"sentence": "Seems the \"program scan\" feature did NOT find the EXE file for Outlook!"},{"keys": [], "sentence": "It did find Outlook Express, but that's not what I use."},{"keys": [], "sentence": "Before I managed to manually add the program file, I contacted Symantec support."},{ "keys" : [{"feature" : "support", "opstr" : -2, "status" : ["u"]}],"sentence": "Like most of their solutions (which first blame other applications for errors), the tech persons line was that this was probably a Microsoft error - it was NOT."},{ "keys" : [{"feature" : "Symantec", "opstr" : -2, "status" : []}],"sentence": "It was a Symantec error."},{ "keys" : [{"feature" : "update", "opstr" : -3, "status" : []}],"sentence": "After a recent update, I can no longer open more then 1 browser window."},{ "keys" : [{"feature" : "support", "opstr" : -3, "status" : []}],"sentence": "I've searched the program and their online tech support (worthless) and have found no solutions."},{"keys": [], "sentence": "Again, I tried online email support."},{"keys": [], "sentence": "They gave me a ridiculous set of steps which included emailing them screen prints as PDF files!"},{"keys": [], "sentence": "I use the program like most other people - in DISABLED mode."},{"keys": [], "sentence": "Eventually I will uninstall this troublesome bug-filled program."},{"keys": [], "sentence": "Maybe it's time to explore McAfee products again..."}],[],[{ "keys" : [{"feature" : "products", "opstr" : -1, "status" : []}],"sentence": "This is definitely one of those products, especially as the company is leaning more towards making a profit."}],[],[{"keys": [], "sentence": "I wish I'd done some research first...."}],[{ "keys" : [{"feature" : "NIS 2004", "opstr" : 2, "status" : []}],"sentence": "I've been using NIS 2004 for about 2 months and it works well."},{ "keys" : [{"feature" : "options", "opstr" : -1, "status" : []},{"feature" : "intrusion", "opstr" : 2, "status" : []}],"sentence": "Some of the options are confusing, especially when the popup warnings occur, but I've had no problems with intrusions."},{ "keys" : [{"feature" : "intrusion", "opstr" : 3, "status" : []}],"sentence": "Norton pops up a window about the intrusions and gives me as much detail as possible about where the intrusion is coming from."},{ "keys" : [{"feature" : "popup blocker", "opstr" : 2, "status" : []},{"feature" : "anti-spam", "opstr" : 2, "status" : []}],"sentence": "The popup blocker and anti-spam are bonuses."}],[{ "keys" : [{"feature" : "Product", "opstr" : 1, "status" : []},{"feature" : "instruction", "opstr" : -1, "status" : []}],"sentence": "Product is OK; however, despite the fact that I followed the rebate instructions explicitly, I am being denied the rebate because the processing agency incorrectly claims I did not send in proof of ownership of a previous product."},{"keys": [], "sentence": "Not much recourse for the consumer in these cases."}],[{ "keys" : [{"feature" : "nstalling", "opstr" : 1, "status" : []}],"sentence": "I didn't have any major problems installing this software."},{ "keys" : [{"feature" : "components", "opstr" : -1, "status" : []}],"sentence": "The only problem I had was a few components didn't quite load correctly upon startup, but a reboot fixed the problem."},{"keys": [], "sentence": "I had NIS 2003 and was very happy with it; this new version really doesn't seem to offer a lot of exciting new features, seems merely the same as 2003 dressed-up to look like a new version."},{ "keys" : [{"feature" : "working", "opstr" : 2, "status" : []}],"sentence": "Anyhow, this software is working fine and no problems since I installed it two weeks ago."},{ "keys" : [{"feature" : "installation", "opstr" : -1, "status" : []}],"sentence": "I give it 4-stars only because the installation process - or rather problems that may surface during the installation process - can be frustrating to the average computer user."},{ "keys" : [{"feature" : "installation", "opstr" : -1, "status" : []}],"sentence": "#If you experience problems with installation, you can visit symantec's website, click the support tab, click the 'home or home office support' and there is an automated support assistant that can scan the Norton program files on your computer and it will tell you what is not working right and how to fix it."},{ "keys" : [{"feature" : "installation", "opstr" : -1, "status" : ["u"]}],"sentence": "Can't get easier than that!"},{"keys": [], "sentence": "Avoid like the plague."},{ "keys" : [{"feature" : "spam", "opstr" : -2, "status" : []}],"sentence": "I already knew something was wrong, because much of the Spam I've seen in the past six months was from resellers of Norton products."},{"keys": [], "sentence": "For Norton to encourage Spammers by letting them sell their products is a very bad sign."}],[{"keys": [], "sentence": "Well, I must be one of the few fortunate ones on here."},{ "keys" : [{"feature" : "install", "opstr" : 2, "status" : []}],"sentence": "Mine installed no problem (but I DID uninstall my Norton Anti-Virus 2002 & Personal Firewall 2002 first)."},{ "keys" : [{"feature" : "work", "opstr" : 3, "status" : []}],"sentence": "Seems to work great."},{"keys": [], "sentence": "Sorry to hear about all the other folk's problems....makes me wonder why I'm NOT having any (I'm running Win XP as well)."}],[{"keys": [], "sentence": "I had Norton Internet Security 2003 and it worked great...one of the features that I liked was the user interface as well as the ad/pop-up blocking feature along w/the logs on internet usage."},{ "keys" : [{"feature" : "NIS 04", "opstr" : -3, "status" : []}],"sentence": "I read many reviews on Norton I.S. 2004 from a variety of sources (Cnet, Amazon, message boards) and came to the conclusion that NIS 04 was a terrible product and not worth the update."},{"keys": [], "sentence": "In January of 2004, I renewed my subscription service for NIS 2003 but on Jan 7, everything changed."},{"keys": [], "sentence": "There was a Verisign problem that conflicted w/Word and Excel and was posted on the Symantec site that affected computers."},{"keys": [], "sentence": "The Symantec site said it didn't affect NIS but I believe it did."},{"keys": [], "sentence": "I also believe that when I renewed my subscription service that Symantec uploaded the NIS 2004 patch."},{"keys": [], "sentence": "All of a sudden everything that reviewers were writing about NIS 2004 was happening to my computer."},{ "keys" : [{"feature" : "booting", "opstr" : -3, "status" : []}],"sentence": "Booting up my computer took forever!!!"},{ "keys" : [{"feature" : "blocking", "opstr" : -3, "status" : []}],"sentence": "Then, my ad/pop-up blocking was completely gone."},{ "keys" : [{"feature" : "blocking", "opstr" : -3, "status" : []}],"sentence": "My file log was not responding and the program was not blocking any cookies or unauthorized sites."},{"keys": [], "sentence": "After extensive researching on the Symantec site I broke down and called Symantec."},{ "keys" : [{"feature" : "Tech Line", "opstr" : -2, "status" : []}],"sentence": "Again, every review written about the Tech Line is true...after waiting close to 45 minutes I finally spoke to a rep."},{"keys": [], "sentence": "I had to pay $29.95 just to go any further."},{ "keys" : [{"feature" : "tech", "opstr" : -2, "status" : []}],"sentence": "After telling the rep and his tech supervisor the problem the only answer was to uninstall the program (which I had already done)..."},{"keys": [], "sentence": "They sent me a link to their website to follow instructions on ridding my registry of all Symantec products so I could get a clean re-install."},{ "keys" : [{"feature" : "tech", "opstr" : -3, "status" : ["p"]}],"sentence": "They didn't know what the problem could be."},{"keys": [], "sentence": "They said to call back if it still didn't work after the complete uninstall."},{ "keys" : [{"feature" : "support", "opstr" : -3, "status" : ["p"]}],"sentence": "I did it and it was worse the second time around...unbelievable."},{"keys": [], "sentence": "I gave up."},{ "keys" : [{"feature" : "Tech", "opstr" : -3, "status" : []}],"sentence": "Basically, I ate the cost of the renewal and ate the cost of the Tech Help."}],[{"keys": [], "sentence": "NIS is a package of several Norton products."},{ "keys" : [{"feature" : "unstalling", "opstr" : -1, "status" : []}],"sentence": "Unfortunately, it does not give you the option of unstalling (or uninstalling) them individually."},{"keys": [], "sentence": "If you get NIS be sure you want ALL of them installed and running on your machine."},{ "keys" : [{"feature" : "components", "opstr" : -1, "status" : []}],"sentence": "You can \"disable\" some of the individual components, but don't be fooled--they're still there and running."},{ "keys" : [{"feature" : "Norton AntiSpam", "opstr" : -2, "status" : []}],"sentence": "Although I disabled Norton AntiSpam, it is still there."},{"keys": [], "sentence": "Every time I start Eudora, a message from AntiSpam pops up telling me that COM automation needs to be turned on for it to run properly."},{"keys": [], "sentence": "I guess the possibility that someone might not want it to run at all never occured to the designers."},{"keys": [], "sentence": "Just to try to shut it up, I told it to go ahead and turn on COM automation."},{ "keys" : [{"feature" : "product", "opstr" : 2, "status" : []}],"sentence": "This did manage to cut the number of popups during start-up from 4 down to 2."},{ "keys" : [{"feature" : "popups", "opstr" : -2, "status" : ["u"]}],"sentence": "But those 2 come up every time."},{"keys": [], "sentence": "And this despite the fact that I'm not even using AntiSpam."},{ "keys" : [{"feature" : "Norton", "opstr" : -2, "status" : []},{"feature" : "charge", "opstr" : -2, "status" : []}],"sentence": "Next, the big reason not to buy ANY Norton product:  If there's a problem with it, Norton charges $30 to even tell them about it."},{ "keys" : [{"feature" : "charge", "opstr" : -2, "status" : []},{"feature" : "Norton", "opstr" : -2, "status" : ["p"]}],"sentence": "Sure they say if it's their fault you won't get charged, but THEY are the ones who get to decide whether it's their fault."},{"keys": [], "sentence": "And you have to put up the 30 bucks to get them to decide."},{"keys": [], "sentence": "Nice little racket they've got there."}],[{"keys": [], "sentence": "I bought Norton Internet Security years ago when it first came out."},{ "keys" : [{"feature" : "NIS ", "opstr" : 1, "status" : []}],"sentence": "While it didn't have all the features I would have liked, it was better than anything else I could find at the time."}],[{ "keys" : [{"feature" : "installing", "opstr" : -2, "status" : []}],"sentence": "The problems I had installing Norton extended way beyond what Symantec should reasonably expect the public to deal with."},{ "keys" : [{"feature" : "install", "opstr" : -3, "status" : []}],"sentence": "When I purchase software, I NEVER want to have to spend hours looking up solutions to my install problems -- in particular solutions that involve manually setting driver preferences or editing the registry!"}],[{"keys": [], "sentence": "This is a very full featured product."},{"keys": [], "sentence": "It checks every 5 minutes for virus and spam definition updates."},{ "keys" : [{"feature" : "Spam killer", "opstr" : 2, "status" : []}],"sentence": "Also, with one click you can help train your spam killer."},{ "keys" : [{"feature" : "wizard", "opstr" : 2, "status" : []}],"sentence": "And the firewall came with a wizard which made it effortless to configure it to my LAN."}],[{ "keys" : [{"feature" : "download", "opstr" : -3, "status" : []}],"sentence": "I downloaded this set from Norton, and within minutes my Internet connection failed and my PC was almost dead due to registry problems from the download."},{"keys": [], "sentence": "I was forced to re-format the next day due to extensive incapatability issues."},{"keys": [], "sentence": "I lost all my personal info."},{ "keys" : [{"feature" : "help", "opstr" : -3, "status" : []}],"sentence": "Their site offers no live help at all."},{ "keys" : [{"feature" : "service", "opstr" : -3, "status" : []},{"feature" : "support", "opstr" : -3, "status" : []}],"sentence": "I tried to call Norton, and the only numbers they list on their sites are either for Non-tech Customer Service (tried this one and hung up after 75 minute of MUZAC) or they have a $30 tech-support number."},{ "keys" : [{"feature" : "cost", "opstr" : -3, "status" : []}],"sentence": "Who wants to pay $30 to discuss a defect in a product that just cost $95? (I also bought the back-up CD)."},{ "keys" : [{"feature" : "support", "opstr" : -2, "status" : []}],"sentence": "I finally got a free support number for Norton through my ISP support staff, but waited an hour or more for a voice."},{ "keys" : [{"feature" : "refund", "opstr" : -3, "status" : []}],"sentence": "They said they would refund all the money, but a month later, they tell me now the back-up disc is not refundable as its cost is purely handling and shipping - $15 to \"handle\" and ship a CD? --and they have been indignant and combative on the phone and in emails."},{ "keys" : [{"feature" : "product", "opstr" : -2, "status" : []},{"feature" : "support", "opstr" : -3, "status" : []}],"sentence": "This is a terrible company with a bad product and awful support."},{ "keys" : [{"feature" : "support", "opstr" : -3, "status" : ["cc"]}],"sentence": "After 10 years, I now downloaded McCaffee's product after calling their support....they answered quickly, and for free, and were very helpful."},{ "keys" : [{"feature" : "Norton", "opstr" : -2, "status" : []}],"sentence": "No problems now, just a sickly disappointment in the way Norton has abandoned thier customers."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "I see many other reviews that say the same....stay away from Norton, they don't deserve you, or anyone!"},{"keys": [], "sentence": "A security software suite with lots of value"},{"keys": [], "sentence": "While I understand the complaints about Symantec's Norton SystemWorks software suite (which are totally justified), the same can't be said for Norton Internet Security."},{ "keys" : [{"feature" : "firewall", "opstr" : 3, "status" : []},{"feature" : "antivirus", "opstr" : 3, "status" : []},{"feature" : "antispam", "opstr" : 2, "status" : []},{"feature" : "Parental Control", "opstr" : 2, "status" : []}],"sentence": "It's a highly rated, KICK ASS firewall program that's bundled with the venerable Norton AntiVirus, plus extras (like Norton AntiSpam & Norton Parental Control) that make this security suite a must-have for people who have broadband internet access."},{"keys": [], "sentence": "Detractors should spend more time actually customizing the program to meet their needs instead of being lazy & complaining just for the hell of it."},{"keys": [], "sentence": "Once you set it up, you barely even notice it's even there."}],[{ "keys" : [{"feature" : "version 2004", "opstr" : -2, "status" : []}],"sentence": "I've alway liked Symantec products, except for this version 2004."},{ "keys" : [{"feature" : "installing", "opstr" : -2, "status" : []}],"sentence": "If you are already using a previous version of nortron security and unistalled it to install the new version, you will still have all kind of problems in installing the new version on your system!"},{"keys": [], "sentence": "It seems like Symantec did a lousy job on this version."},{ "keys" : [{"feature" : "product", "opstr" : 1, "status" : []}],"sentence": "Luckly,with 3 rebates this product will cost me nothing! it is indeed worth nothing."},{ "keys" : [{"feature" : "install", "opstr" : -1, "status" : []},{"feature" : "uninstall", "opstr" : -2, "status" : []}],"sentence": "To install that version you have to uninstall from the window registery anything called Symantec or Nortron,... also from the common files in the program folder the symantec folder has to be deleted."},{"keys": [], "sentence": "If you got stuck do what I did,search for any folder called symantec and delete it! then install that program(assuming you know what you are doing)."},{ "keys" : [{"feature" : "installation", "opstr" : -2, "status" : []}],"sentence": "If you have no previous version of  nortron security on your system, or Nortron Antivirus, the installation will go fine, otherwise dig in and in to do a major registery clean up!the old programs will leave a trace that will mess up the new installation, even if you uninstalled the old programs perfectly."},{ "keys" : [{"feature" : "support", "opstr" : -3, "status" : []}],"sentence": "What dissapointes me the most that a software like that  is not cheap gets zero support form symantec, if you want support, they'll charge you a Fee!"},{ "keys" : [{"feature" : "zone alarm", "opstr" : 2, "status" : []},{"feature" : "sygate", "opstr" : 2, "status" : ["cc"]}],"sentence": "I've tried the free versions of zone alarm and the free version of sygate and they both have a nice and easy installation and work great!."},{"keys": [], "sentence": "Next year when I purchase a 2005 FireWall version, I am buying the Zone Alarm or the sygate one."},{ "keys" : [{"feature" : "symantec", "opstr" : -3, "status" : []}],"sentence": "I am giving a zero star to symantec for this version!"}],[{"keys": [], "sentence": "I really liked the firewall."},{"keys": [], "sentence": "It can be a pain to configure, but I dealt with it."},{"keys": [], "sentence": "THEN all of a sudden when I restarted my pc, I couldn't get to anything in IE."},{"keys": [], "sentence": "I have gone to their site many times in the last two months looking for an answer."},{"keys": [], "sentence": "I've tried lots of things they suggest."},{"keys": [], "sentence": "My computer configuration is probably all screwed up at this point."},{ "keys" : [{"feature" : "help", "opstr" : 1, "status" : []}],"sentence": "The only free help you get is in renewing your subscription!"},{ "keys" : [{"feature" : "Firewall", "opstr" : -1, "status" : []}],"sentence": "The only way my pc internet works is if I open the Firewall Program configuration and manually refresh it."},{"keys": [], "sentence": "It's become tedious doing this."},{"keys": [], "sentence": "Wish I hadn't renewed my subscription."},{"keys": [], "sentence": "Buy ZONE Alarm."},{"keys": [], "sentence": "Wish I had."}],[{"keys": [], "sentence": "I read how the buyers of this product watched their computers turn into processing sloths, bought a copy and watched my 2.4 Gig XP Pro processor slow down below the level of my 750 Meg 2000Pro laptop!"},{"keys": [], "sentence": "At the same time I bought PC-Cillin for the laptop and what a slick product!"},{"keys": [], "sentence": "So now, when we type, half the time the XP Pro 2.4 Gig PC lags behind the input, sometime by 10 characters!"},{ "keys" : [{"feature" : "Symantec", "opstr" : -2, "status" : []}],"sentence": "Symantec should give us all a refund and apology!"},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : []}],"sentence": "I will NEVER buy their product again at this rate, and neither should you."},{"keys": [], "sentence": "BEWARE!!!!"}],[{ "keys" : [{"feature" : "product", "opstr" : 3, "status" : []}],"sentence": "The product has worked perfectly for me on my XP."},{ "keys" : [{"feature" : "antivirus", "opstr" : 3, "status" : []}],"sentence": "No more banner ads, pop-ups, and the reliable antivirus."},{ "keys" : [{"feature" : "antivirus", "opstr" : 3, "status" : []}],"sentence": "I work on word, explorer, netscape, acrobat reader, photoshop at same time (meaning using a lot of memory), but still dont see a problem with computer (getting slow or crashing)."},{"keys": [], "sentence": "I have XP with 256MB RAM, 40GB memory."},{ "keys" : [{"feature" : "product", "opstr" : 3, "status" : ["cc"]}],"sentence": "This product is way cooler than anything Ive used before (PcCillins and McCafees and Norton Antivirus alone)."},{ "keys" : [{"feature" : "product", "opstr" : 3, "status" : ["u"]}],"sentence": "5 stars all the way!"}],[{"keys": [], "sentence": "I've had the last 3 versions of NIS."},{ "keys" : [{"feature" : "Product ", "opstr" : 1, "status" : []}],"sentence": "All in all it hasn't been a bad product."},{ "keys" : [{"feature" : "Symantec", "opstr" : -2, "status" : []}],"sentence": "However, Symantec has taken a significant turn for the worse with this release."}],[{ "keys" : [{"feature" : "firewall", "opstr" : 2, "status" : []},{"feature" : "security suite", "opstr" : -2, "status" : []}],"sentence": "While it has a rather effective firewall, and comes with Norton Antivirus (which I'm actually rather fond of), the Security Suite has significantly slowed down my system."},{ "keys" : [{"feature" : "boot", "opstr" : -2, "status" : []}],"sentence": "I'm currently using a Sony Vaio S-150 (which I bought at the end of this past August), and it takes about five minutes just to boot the system - in fact, I've taken to just hibernating, rather than shutting down completely."},{ "keys" : [{"feature" : "antivirus", "opstr" : 2, "status" : []},{"feature" : "internet security", "opstr" : -1, "status" : []}],"sentence": "s)##The Antivirus is good, but \"Internet Security\" just isn't worth it."}],[{ "keys" : [{"feature" : "performance", "opstr" : 2, "status" : []}],"sentence": "I've owned many Norton products in my time, and for the most part, I've been pleased with their performance."},{ "keys" : [{"feature" : "NIS 2004", "opstr" : 2, "status" : []}],"sentence": "#This is also the case with NIS 2004."},{"keys": [], "sentence": "I've seen many reviews praising 2003 and cursing 2004."},{ "keys" : [{"feature" : "upgrade", "opstr" : 2, "status" : []}],"sentence": "erformance[+1]##I upgraded from NIS 2003, and the change in performance has not been noticeable."},{ "keys" : [{"feature" : "upgrade", "opstr" : 3, "status" : []}],"sentence": "On the contrary, I'm quite pleased with my upgrade."},{ "keys" : [{"feature" : "performance", "opstr" : 3, "status" : ["u","cs"]},{"feature" : "features", "opstr" : 3, "status" : []}],"sentence": "It works better and has more useful features than NIS 2003."}],[{"keys": [], "sentence": "I bought this product after reading the Editor's Choice article at PC Magazine and had a great experience with Amazon (as usual)."},{ "keys" : [{"feature" : "program", "opstr" : 2, "status" : []}],"sentence": "The program is fully featured, with much of what you'd want from a security program --"},{"keys": [], "sentence": "I was upgrading from a version of Norton Anti-virus that was about a year old in order to get spam and pop-up control."},{"keys": [], "sentence": "My previous experience with multiple Symantec/Norton products has been good."},{ "keys" : [{"feature" : "installation", "opstr" : 1, "status" : []},{"feature" : "set-up", "opstr" : 1, "status" : []},{"feature" : "operation interfaces", "opstr" : 1, "status" : []},{"feature" : "email spam", "opstr" : 1, "status" : []}],"sentence": "The installation, set-up, and operating interfaces are well organized and intuitive and the email spam component works well."},{ "keys" : [{"feature" : "symantec", "opstr" : -3, "status" : []}],"sentence": "HOWEVER, I AM VERY DISAPPOINTED WITH THIS PRODUCT AND WITH SYMANTEC."},{ "keys" : [{"feature" : "performance", "opstr" : -2, "status" : ["u"]}],"sentence": "It feels like I'm back to the days of 56k dial-up internet service, even though I'm running a Dell 2GHz Pentium 4 with 256MB memory and have had excellent broadband service for the past year."},{ "keys" : [{"feature" : "performance", "opstr" : -2, "status" : ["u"]}],"sentence": "I tried disabling the various components provided with this product, paring it all the way back to anti-virus only service... and saw no improvement."},{ "keys" : [{"feature" : "symantec/Norton site", "opstr" : -2, "status" : []}],"sentence": "There is absolutely nothing useful at the Symantec/Norton site."},{"keys": [], "sentence": "I am going to uninstall this and stick with my old version until they offer a fix or until I can find a program from another vendor."},{"keys": [], "sentence": "I purchased this even though I saw some disparaging reviews at the Amazon site, trusting PC Magazine to get it right."},{ "keys" : [{"feature" : "PRODUCT", "opstr" : -3, "status" : []}],"sentence": "However, I suspect that many people are having a bad experience -- DO NOT PURCHASE THIS PRODUCT."}],[{ "keys" : [{"feature" : "Uninstall", "opstr" : 3, "status" : []},{"feature" : "Install", "opstr" : 3, "status" : []}],"sentence": "PIII 1Ghz 512MB RDRAM Windows XP Pro 80GB HD  I was able to Uninstall NIS 2003 and Install NIS 2004 with no trouble."},{"keys": [], "sentence": "First, I turned off my cable modem."},{"keys": [], "sentence": "Then I disabled both Norton Antivirus and Norton Internet Security."},{"keys": [], "sentence": "I used \"Add/Remove Programs\" to unistall NIS 2003."},{"keys": [], "sentence": "In \"Add/Remove, you must selecting the program's Change button."},{"keys": [], "sentence": "After that was complete, I deleted the Norton Antivirus and Norton Internet Security folders left in the \"Programs\" section of Windows XP."},{"keys": [], "sentence": "Next I de-fragged my hard drive."},{"keys": [], "sentence": "I did not use the Rnis.exe, since I have WinFax Pro on my system. I did not touch the Windows Registry, for the same reason."},{ "keys" : [{"feature" : "install", "opstr" : 2, "status" : []}],"sentence": "I installed, activated and registered NIS 2004 without issue."},{ "keys" : [{"feature" : "Anti-Spam", "opstr" : 3, "status" : []}],"sentence": "So far, the Anti-Spam feature seems to be very good."}],[{"keys": [], "sentence": "I ain't no computer geek, but I can wrestle with the best of them."},{ "keys" : [{"feature" : "program", "opstr" : -2, "status" : []}],"sentence": "This program would not let me send Outlook Email or listen to Audible sample books online."},{"keys": [], "sentence": "I gave up trying to figure how to get my email sent or listen to streaming programs."},{ "keys" : [{"feature" : "product", "opstr" : -3, "status" : ["u"]}],"sentence": "Buy this if you like mental challenges or trying how to pick locks."},{"keys": [], "sentence": "For security buy Zone Alarm. It's a very friendly program."}],[{"keys": [], "sentence": "I was begining to think I was computer-retarded after dealing with this program."},{"keys": [], "sentence": "I was using this on my 2001 Dell laptop (which worked fine until I upgraded to this junk!)"},{ "keys" : [{"feature" : "processor", "opstr" : -3, "status" : []}],"sentence": "I had much of the same problems that everyone else has listed (mainly the SLOOOOOOOOOW processor), and then I couldn't get the damn thing off my computer completely!"},{"keys": [], "sentence": "I decided to give it one last chance... so I formatted my hard drive, reinstalled Windows XP (which also required a day & night download/install of SP2 on dial-up) and put NIS2004 back onto the computer."},{ "keys" : [{"feature" : "install", "opstr" : -1, "status" : []}],"sentence": "It locked during install and I had to reformat the drive and start from scratch (GRRRRRR!)"},{"keys": [], "sentence": "Blessedly, my DSL was installed just about this time and I set up a wireless network with my desktop."},{"keys": [], "sentence": "So when I reformatted for the third time, downloading SP2 took no time at all and the new XP was kind enough to even suggest other antivirus programs to try (it also listed Norton and McAffee)."},{ "keys" : [{"feature" : "Computer Associates EZ", "opstr" : 1, "status" : []}],"sentence": "I downloaded a trial version of Computer Associates EZ Firewall and Antivirus and fell in love with a computer security system all over again."},{"keys": [], "sentence": "I can't recommend their programs enough."},{ "keys" : [{"feature" : "Norton", "opstr" : -3, "status" : []}],"sentence": "And I can't warn you enough to STAY AWAY FROM NORTON!!"}],[{"keys": [], "sentence": "I originally bought McAfee VirusScan 7 from Amazon."},{"keys": [], "sentence": "About a month ago, it had an error that I could not fix and the program would not update."},{"keys": [], "sentence": "Even though I had 6+ months left on the McAfee subscription, I decided to move on and buy Norton Internet Security 2004 (NIS)."},{ "keys" : [{"feature" : "installation", "opstr" : 2, "status" : []}],"sentence": "I did not have any of the installation problems that people highlighted here."},{"keys": [], "sentence": "I did remove all remnants of McAfee before installing and confirmed the Windows XP firewall was off."},{ "keys" : [{"feature" : "speed", "opstr" : -2, "status" : ["u"]}],"sentence": "It was immediately noticeable that NIS slows down my computer (Pent4, 256 RAM)."},{ "keys" : [{"feature" : "size", "opstr" : -2, "status" : []},{"feature" : "scanning", "opstr" : -1, "status" : []}],"sentence": "I think it is a combination of the program size taking up resources and the open/close scanning that it does with every program."},{ "keys" : [{"feature" : "scan", "opstr" : -1, "status" : []}],"sentence": "Is it necessary to scan my MS Money database when I close the program?"},{"keys": [], "sentence": "I'm not sure how it would have been compromised by a virus."}],[{ "keys" : [{"feature" : "firewall", "opstr" : -3, "status" : []}],"sentence": "I have a modern PC with lots of speed and memory, but this firewall just brought it to a halt."},{ "keys" : [{"feature" : "slow", "opstr" : -2, "status" : ["u"]}],"sentence": "Start up, log off, log on...everything became very slow."},{ "keys" : [{"feature" : "home network", "opstr" : -2, "status" : []}],"sentence": "Configuring it for a home network was almost impossible."},{ "keys" : [{"feature" : "network", "opstr" : -3, "status" : []}],"sentence": "Multiple users on one machine never seemed to behave like you'd expect."},{"keys": [], "sentence": "Avoid at all costs"},{"keys": [], "sentence": "I just about lost it this morning with this software."},{ "keys" : [{"feature" : "alerts", "opstr" : -2, "status" : []}],"sentence": "While I was trying to play Half Life 2 it started popping up with \"alerts\" every twenty seconds (literally), warning me my antivirus protection was off."},{ "keys" : [{"feature" : "alerts", "opstr" : -2, "status" : []}],"sentence": "But it wouldn't let me turn the AV protection back on and it wouldn't stop with the alerts."},{ "keys" : [{"feature" : "uninstall", "opstr" : -2, "status" : []}],"sentence": "I had tried to uninstall Norton Internet Security a few weeks ago, and it wouldn't let me do that either."},{ "keys" : [{"feature" : "Uninstall", "opstr" : -1, "status" : ["u"]}],"sentence": "I tried it again this morning and it said I didn't have the required \"permissions\" and lacked proper administrator status."},{"keys": [], "sentence": "On my own home computer."},{ "keys" : [{"feature" : "Symantec customer service", "opstr" : -3, "status" : []}],"sentence": "Of course, if you try to reach Symantec customer service you get useless automated systems unless you want to pay $30 per incident."},{"keys": [], "sentence": "Meanwhile, the damn alert is still popping up every 20 seconds."},{"keys": [], "sentence": "Finally I ran msconfig and went into the \"services\" tab and unchecked every last Norton/Symantec \"service,\" then ran uninstall again."},{ "keys" : [{"feature" : "uninstallation", "opstr" : -1, "status" : []}],"sentence": "This time, it started the uninstallation process, then I left for work. I think it will work. I hope it will work."},{ "keys" : [{"feature" : "Symantec", "opstr" : -3, "status" : []}],"sentence": "I simply hate Symantec. I swear, if I could have physically ripped that software out of my computer with my bare, bleeding hands, I would have."}],[{"keys": [], "sentence": "I have been a loyal Norton Anti-Virus and Internet Security software user for as long as I can remember."},{ "keys" : [{"feature" : "products", "opstr" : 3, "status" : []}],"sentence": "Their products have been great and have saved my bacon on numerous occasions."}]]}}
